---
kind: method
id: M:Autodesk.Revit.DB.SaveAsOptions.Dispose
source: html/6c5466cc-60f7-a9c1-3090-0c4d71f048b0.htm
---
# Autodesk.Revit.DB.SaveAsOptions.Dispose Method

Releases all resources used by the SaveAsOptions

## Syntax (C#)
```csharp
public void Dispose()
```